{
  "education": [
    {
      "awards_achievements": [
        "GPA 3.2/4.0"
      ],
      "degree": "Bachelor of Engineering",
      "department": "Software Engineering",
      "duration": "2015-2020",
      "school_name": "McMaster University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_NarimanAlimuradov",
  "highlighted_projects": [
    {
      "description": "Built and cloud-hosted a Python recommendation model that uses the Reddit API to suggest new subreddits (online communities) to the user based on the subreddits they like. Reddit user activity is periodically aggregated to optimize and update the recommendations over time. Deployed using Flask and Heroku. Try it out at https://subreddits.nalimuradov.com.",
      "git_url": "https://github.com/nalimuradov/subreddit_recommender",
      "name": "Subreddit Recommender"
    },
    {
      "description": "Developed a Python machine learning application that estimates the viewership success of a YouTube video by analyzing the video title and thumbnail. NLTK and natural language processing heuristics are used to evaluate the video title, and Keras image recognition models are used to evaluate the thumbnail. Training data was web-scraped and fetched using the YouTube API. Deployed using Flask at https://thumbnail.nalimuradov.com.",
      "git_url": "https://github.com/nalimuradov/thumbnail_evaluator",
      "name": "YouTube Thumbnail Evaluator"
    },
    {
      "description": "Created a React web application that generates the user a team of six Pokemon based on their filters and criteria. All assets stored externally and fetched at runtime when required to allow for a lightweight design. Written in JavaScript, HTML, CSS, and deployed with the help of Heroku, Github, and Node.js. Available at https://pokemon.nalimuradov.com.",
      "git_url": "https://github.com/nalimuradov/pokemon_team",
      "name": "Pokemon Team Generator"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux monitoring agent that allows a user to monitor and store machine specifications and usage information for multiple Linux systems. The agent employs Bash Scripts to collect machine hardware information, which is then stored in a PostgreSQL database provisioned using Docker. Resource usage is fetched periodically with Crontab and the data aggregated can then be manipulated using SQL queries.",
      "git_url": "linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Currently in progress!",
        "JDBC App: Currently in progress!",
        "Grep App: Currently in progress!"
      ],
      "git_url": "core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Nariman Alimuradov",
  "others": [
    {
      "bullets": [
        "Volunteer, Workshop Teacher @ McMaster’s Children and Youth University (2018-2019): Designed and taught a tech workshop class to students at elementary schools across Hamilton.",
        "Volunteer, Crisis Text Responder @ Kids Help Phone (2020-Present): Provided confidential support and further resources for young texters in distress."
      ],
      "title": "Volunteering"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Collaborated in a Scrum team within an Agile environment as a data engineer. Implemented software projects using a variety of technologies such as Linux, Java, SQL, Docker, Git, and GCP to familiarize with current market trends.",
      "duration": "2020-present",
      "title": "Data Engineer"
    },
    {
      "company": "Adlib Software",
      "description": "Worked as a software developer in an Agile environment on the machine learning team. Created an object detection neural net that locates signatures and handwriting on documents using Python and Keras, allowing clients to automatically validate their files in seconds. Implemented Python automation tools for testing NLP model accuracy. Integrated a C# speech-to-text model for client audio file conversion and meeting transcription.",
      "duration": "2019",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "Linux/Bash",
      "HTML/CSS",
      "Flask",
      "REST API",
      "Keras"
    ],
    "familiar": [
      "React",
      "Node.js",
      "AWS",
      "Android",
      "Docker"
    ],
    "proficient": [
      "Python",
      "Java",
      "SQL",
      "JavaScript",
      "Git"
    ]
  },
  "summary": "Hi I'm Nariman, a graduate from McMaster University's software engineering program and I have recently joined Jarvis as a data engineer! During my undergrad, I spent eight months as a software developer for Adlib Software, where I designed document detection models on the machine learning team. I enjoy spending my free time volunteering. While at McMaster, I spent a year teaching workshop classes to students at elementary schools across Hamilton, and during the past six months, I have been volunteering as a crisis responder for the Kids Help Phone text line. I love programming and computer science because it is a language that can be applied to every facet of life. Software provides immeasurable benefits to everything in our lives and I think it's important to have a deep understanding of it."
}
